GopalSaraf/Practicals/PSDL/include/proc/pic16f17126.h
// Register: RC0I2C
#define RC0I2C RC0I2C
extern volatile unsigned char           RC0I2C              __at(0x1EE9);
#ifndef _LIB_BUILD
asm("RC0I2C equ 01EE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
} RC0I2Cbits_t;
extern volatile RC0I2Cbits_t RC0I2Cbits __at(0x1EE9);
// bitfield macros
#define _RC0I2C_TH_POSN                                     0x0
#define _RC0I2C_TH_POSITION                                 0x0
#define _RC0I2C_TH_SIZE                                     0x2
#define _RC0I2C_TH_LENGTH                                   0x2
#define _RC0I2C_TH_MASK                                     0x3
#define _RC0I2C_PU_POSN                                     0x4
#define _RC0I2C_PU_POSITION                                 0x4
#define _RC0I2C_PU_SIZE                                     0x2
#define _RC0I2C_PU_LENGTH                                   0x2
#define _RC0I2C_PU_MASK                                     0x30
#define _RC0I2C_SLEW_POSN                                   0x6
#define _RC0I2C_SLEW_POSITION                               0x6
#define _RC0I2C_SLEW_SIZE                                   0x2
#define _RC0I2C_SLEW_LENGTH                                 0x2
#define _RC0I2C_SLEW_MASK                                   0xC0
#define _RC0I2C_TH0_POSN                                    0x0
#define _RC0I2C_TH0_POSITION                                0x0
#define _RC0I2C_TH0_SIZE                                    0x1
#define _RC0I2C_TH0_LENGTH                                  0x1
#define _RC0I2C_TH0_MASK                                    0x1
#define _RC0I2C_TH1_POSN                                    0x1
#define _RC0I2C_TH1_POSITION                                0x1
#define _RC0I2C_TH1_SIZE                                    0x1
#define _RC0I2C_TH1_LENGTH                                  0x1
#define _RC0I2C_TH1_MASK                                    0x2
#define _RC0I2C_PU0_POSN                                    0x4
#define _RC0I2C_PU0_POSITION                                0x4
#define _RC0I2C_PU0_SIZE                                    0x1
#define _RC0I2C_PU0_LENGTH                                  0x1
#define _RC0I2C_PU0_MASK                                    0x10
#define _RC0I2C_PU1_POSN                                    0x5
#define _RC0I2C_PU1_POSITION                                0x5
#define _RC0I2C_PU1_SIZE                                    0x1
#define _RC0I2C_PU1_LENGTH                                  0x1
#define _RC0I2C_PU1_MASK                                    0x20
#define _RC0I2C_SLEW0_POSN                                  0x6
#define _RC0I2C_SLEW0_POSITION                              0x6
#define _RC0I2C_SLEW0_SIZE                                  0x1
#define _RC0I2C_SLEW0_LENGTH                                0x1
#define _RC0I2C_SLEW0_MASK                                  0x40
#define _RC0I2C_SLEW1_POSN                                  0x7
#define _RC0I2C_SLEW1_POSITION                              0x7
#define _RC0I2C_SLEW1_SIZE                                  0x1
#define _RC0I2C_SLEW1_LENGTH                                0x1
#define _RC0I2C_SLEW1_MASK                                  0x80

// Register: RC1I2C
#define RC1I2C RC1I2C
extern volatile unsigned char           RC1I2C              __at(0x1EEA);
#ifndef _LIB_BUILD
asm("RC1I2C equ 01EEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
} RC1I2Cbits_t;
extern volatile RC1I2Cbits_t RC1I2Cbits __at(0x1EEA);
// bitfield macros
#define _RC1I2C_TH_POSN                                     0x0
#define _RC1I2C_TH_POSITION                                 0x0
#define _RC1I2C_TH_SIZE                                     0x2
#define _RC1I2C_TH_LENGTH                                   0x2
#define _RC1I2C_TH_MASK                                     0x3
#define _RC1I2C_PU_POSN                                     0x4
#define _RC1I2C_PU_POSITION                                 0x4
#define _RC1I2C_PU_SIZE                                     0x2
#define _RC1I2C_PU_LENGTH                                   0x2
#define _RC1I2C_PU_MASK                                     0x30
#define _RC1I2C_SLEW_POSN                                   0x6
#define _RC1I2C_SLEW_POSITION                               0x6
#define _RC1I2C_SLEW_SIZE                                   0x2
#define _RC1I2C_SLEW_LENGTH                                 0x2
#define _RC1I2C_SLEW_MASK                                   0xC0
#define _RC1I2C_TH0_POSN                                    0x0
#define _RC1I2C_TH0_POSITION                                0x0
#define _RC1I2C_TH0_SIZE                                    0x1
#define _RC1I2C_TH0_LENGTH                                  0x1
#define _RC1I2C_TH0_MASK                                    0x1
#define _RC1I2C_TH1_POSN                                    0x1
#define _RC1I2C_TH1_POSITION                                0x1
#define _RC1I2C_TH1_SIZE                                    0x1
#define _RC1I2C_TH1_LENGTH                                  0x1
#define _RC1I2C_TH1_MASK                                    0x2
#define _RC1I2C_PU0_POSN                                    0x4
#define _RC1I2C_PU0_POSITION                                0x4
#define _RC1I2C_PU0_SIZE                                    0x1
#define _RC1I2C_PU0_LENGTH                                  0x1
#define _RC1I2C_PU0_MASK                                    0x10
#define _RC1I2C_PU1_POSN                                    0x5
#define _RC1I2C_PU1_POSITION                                0x5
#define _RC1I2C_PU1_SIZE                                    0x1
#define _RC1I2C_PU1_LENGTH                                  0x1
#define _RC1I2C_PU1_MASK                                    0x20
#define _RC1I2C_SLEW0_POSN                                  0x6
#define _RC1I2C_SLEW0_POSITION                              0x6
#define _RC1I2C_SLEW0_SIZE                                  0x1
#define _RC1I2C_SLEW0_LENGTH                                0x1
#define _RC1I2C_SLEW0_MASK                                  0x40
#define _RC1I2C_SLEW1_POSN                                  0x7
#define _RC1I2C_SLEW1_POSITION                              0x7
#define _RC1I2C_SLEW1_SIZE                                  0x1
#define _RC1I2C_SLEW1_LENGTH                                0x1
#define _RC1I2C_SLEW1_MASK                                  0x80

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x1EEC);
#ifndef _LIB_BUILD
asm("RC4I2C equ 01EECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x1EEC);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_PU_POSN                                     0x4
#define _RC4I2C_PU_POSITION                                 0x4
#define _RC4I2C_PU_SIZE                                     0x2
#define _RC4I2C_PU_LENGTH                                   0x2
#define _RC4I2C_PU_MASK                                     0x30
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x2
#define _RC4I2C_SLEW_LENGTH                                 0x2
#define _RC4I2C_SLEW_MASK                                   0xC0
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_PU0_POSN                                    0x4
#define _RC4I2C_PU0_POSITION                                0x4
#define _RC4I2C_PU0_SIZE                                    0x1
#define _RC4I2C_PU0_LENGTH                                  0x1
#define _RC4I2C_PU0_MASK                                    0x10
#define _RC4I2C_PU1_POSN                                    0x5
#define _RC4I2C_PU1_POSITION                                0x5
#define _RC4I2C_PU1_SIZE                                    0x1
#define _RC4I2C_PU1_LENGTH                                  0x1
#define _RC4I2C_PU1_MASK                                    0x20
#define _RC4I2C_SLEW0_POSN                                  0x6
#define _RC4I2C_SLEW0_POSITION                              0x6
#define _RC4I2C_SLEW0_SIZE                                  0x1
#define _RC4I2C_SLEW0_LENGTH                                0x1
#define _RC4I2C_SLEW0_MASK                                  0x40
#define _RC4I2C_SLEW1_POSN                                  0x7
#define _RC4I2C_SLEW1_POSITION                              0x7
#define _RC4I2C_SLEW1_SIZE                                  0x1
#define _RC4I2C_SLEW1_LENGTH                                0x1
#define _RC4I2C_SLEW1_MASK                                  0x80

// Register: RC5I2C
#define RC5I2C RC5I2C
extern volatile unsigned char           RC5I2C              __at(0x1EED);
#ifndef _LIB_BUILD
asm("RC5I2C equ 01EEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
} RC5I2Cbits_t;
