GopalSaraf/Practicals/PSDL/include/proc/pic16f17126.h
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0xF203);	// @ (0x1E40 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0xF204);	// @ (0x1E40 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN3PPS<CLCIN3PPS5>
extern volatile __bit                   CLCIN3PPS5          __at(0xF205);	// @ (0x1E40 * 8 + 5)
#define                                 CLCIN3PPS5_bit      _BIT_ACCESS(CLCIN3PPS,5)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x14BB);	// @ (0x297 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x14B3);	// @ (0x296 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x14B4);	// @ (0x296 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x14B0);	// @ (0x296 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x14B2);	// @ (0x296 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x14B7);	// @ (0x296 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x866);	// @ (0x10C * 8 + 6)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,6)
// PIE5<CM1IE>
extern volatile __bit                   CM1IE               __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE5,6)
// PIR5<CM1IF>
extern volatile __bit                   CM1IF               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR5,6)
// PMD3<CM1MD>
extern volatile __bit                   CM1MD               __at(0x87E);	// @ (0x10F * 8 + 6)
#define                                 CM1MD_bit           _BIT_ACCESS(PMD3,6)
// PIE5<CM2IE>
extern volatile __bit                   CM2IE               __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE5,7)
// PIR5<CM2IF>
extern volatile __bit                   CM2IF               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR5,7)
// PMD3<CM2MD>
extern volatile __bit                   CM2MD               __at(0x87F);	// @ (0x10F * 8 + 7)
#define                                 CM2MD_bit           _BIT_ACCESS(PMD3,7)
// ADCNT<CNT0>
extern volatile __bit                   CNT0                __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 CNT0_bit            _BIT_ACCESS(ADCNT,0)
// ADCNT<CNT1>
extern volatile __bit                   CNT1                __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 CNT1_bit            _BIT_ACCESS(ADCNT,1)
// ADCNT<CNT2>
extern volatile __bit                   CNT2                __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 CNT2_bit            _BIT_ACCESS(ADCNT,2)
// ADCNT<CNT3>
extern volatile __bit                   CNT3                __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 CNT3_bit            _BIT_ACCESS(ADCNT,3)
// ADCNT<CNT4>
extern volatile __bit                   CNT4                __at(0xE8CC);	// @ (0x1D19 * 8 + 4)
#define                                 CNT4_bit            _BIT_ACCESS(ADCNT,4)
// ADCNT<CNT5>
extern volatile __bit                   CNT5                __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 CNT5_bit            _BIT_ACCESS(ADCNT,5)
// ADCNT<CNT6>
extern volatile __bit                   CNT6                __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 CNT6_bit            _BIT_ACCESS(ADCNT,6)
// ADCNT<CNT7>
extern volatile __bit                   CNT7                __at(0xE8CF);	// @ (0x1D19 * 8 + 7)
#define                                 CNT7_bit            _BIT_ACCESS(ADCNT,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0xE936);	// @ (0x1D26 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// OPA1CON0<CPON>
extern volatile __bit                   CPON                __at(0x4865);	// @ (0x90C * 8 + 5)
#define                                 CPON_bit            _BIT_ACCESS(OPA1CON0,5)
// CPCON<CPOS>
extern volatile __bit                   CPOS                __at(0x106D);	// @ (0x20D * 8 + 5)
#define                                 CPOS_bit            _BIT_ACCESS(CPCON,5)
// CPCON<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1068);	// @ (0x20D * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(CPCON,0)
// CPCON<CPREQ>
extern volatile __bit                   CPREQ               __at(0x106A);	// @ (0x20D * 8 + 2)
#define                                 CPREQ_bit           _BIT_ACCESS(CPCON,2)
// CPCON<CPT>
extern volatile __bit                   CPT                 __at(0x1069);	// @ (0x20D * 8 + 1)
#define                                 CPT_bit             _BIT_ACCESS(CPCON,1)
// CRCCON0<CRCBUSY>
extern volatile __bit                   CRCBUSY             __at(0xE515);	// @ (0x1CA2 * 8 + 5)
#define                                 CRCBUSY_bit         _BIT_ACCESS(CRCCON0,5)
// CRCCON0<CRCEN>
extern volatile __bit                   CRCEN               __at(0xE517);	// @ (0x1CA2 * 8 + 7)
#define                                 CRCEN_bit           _BIT_ACCESS(CRCCON0,7)
// CRCCON0<CRCGO>
extern volatile __bit                   CRCGO               __at(0xE516);	// @ (0x1CA2 * 8 + 6)
#define                                 CRCGO_bit           _BIT_ACCESS(CRCCON0,6)
// PIE1<CRCIE>
extern volatile __bit                   CRCIE               __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 CRCIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<CRCIF>
extern volatile __bit                   CRCIF               __at(0x469);	// @ (0x8D * 8 + 1)
#define                                 CRCIF_bit           _BIT_ACCESS(PIR1,1)
// PMD0<CRCMD>
extern volatile __bit                   CRCMD               __at(0x861);	// @ (0x10C * 8 + 1)
#define                                 CRCMD_bit           _BIT_ACCESS(PMD0,1)
// ADCON2<CRS0>
extern volatile __bit                   CRS0                __at(0xE944);	// @ (0x1D28 * 8 + 4)
#define                                 CRS0_bit            _BIT_ACCESS(ADCON2,4)
// ADCON2<CRS1>
extern volatile __bit                   CRS1                __at(0xE945);	// @ (0x1D28 * 8 + 5)
#define                                 CRS1_bit            _BIT_ACCESS(ADCON2,5)
// ADCON2<CRS2>
extern volatile __bit                   CRS2                __at(0xE946);	// @ (0x1D28 * 8 + 6)
#define                                 CRS2_bit            _BIT_ACCESS(ADCON2,6)
// ADCLK<CS5>
extern volatile __bit                   CS5                 __at(0xE96D);	// @ (0x1D2D * 8 + 5)
#define                                 CS5_bit             _BIT_ACCESS(ADCLK,5)
// OSCCON3<CSWHOLD>
extern volatile __bit                   CSWHOLD             __at(0x147F);	// @ (0x28F * 8 + 7)
#define                                 CSWHOLD_bit         _BIT_ACCESS(OSCCON3,7)
// PIE1<CSWIE>
extern volatile __bit                   CSWIE               __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 CSWIE_bit           _BIT_ACCESS(PIE1,4)
// PIR1<CSWIF>
extern volatile __bit                   CSWIF               __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 CSWIF_bit           _BIT_ACCESS(PIR1,4)
// CWG1CLK<CWG1CS>
extern volatile __bit                   CWG1CS              __at(0x3060);	// @ (0x60C * 8 + 0)
#define                                 CWG1CS_bit          _BIT_ACCESS(CWG1CLK,0)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x3078);	// @ (0x60F * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x3079);	// @ (0x60F * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x307A);	// @ (0x60F * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x307B);	// @ (0x60F * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x307C);	// @ (0x60F * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x307D);	// @ (0x60F * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x3070);	// @ (0x60E * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x3071);	// @ (0x60E * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x3072);	// @ (0x60E * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x3073);	// @ (0x60E * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x3074);	// @ (0x60E * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x3075);	// @ (0x60E * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x3087);	// @ (0x610 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE4<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x481);	// @ (0x90 * 8 + 1)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR4,1)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x3086);	// @ (0x610 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x3093);	// @ (0x612 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x3094);	// @ (0x612 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x3095);	// @ (0x612 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD2<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD2,4)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x3080);	// @ (0x610 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x3081);	// @ (0x610 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x3082);	// @ (0x610 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x30A4);	// @ (0x614 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x30A5);	// @ (0x614 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1PPS<CWG1PPS0>
extern volatile __bit                   CWG1PPS0            __at(0xF1C8);	// @ (0x1E39 * 8 + 0)
#define                                 CWG1PPS0_bit        _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1PPS1>
extern volatile __bit                   CWG1PPS1            __at(0xF1C9);	// @ (0x1E39 * 8 + 1)
#define                                 CWG1PPS1_bit        _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1PPS2>
extern volatile __bit                   CWG1PPS2            __at(0xF1CA);	// @ (0x1E39 * 8 + 2)
#define                                 CWG1PPS2_bit        _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1PPS3>
extern volatile __bit                   CWG1PPS3            __at(0xF1CB);	// @ (0x1E39 * 8 + 3)
#define                                 CWG1PPS3_bit        _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1PPS4>
extern volatile __bit                   CWG1PPS4            __at(0xF1CC);	// @ (0x1E39 * 8 + 4)
#define                                 CWG1PPS4_bit        _BIT_ACCESS(CWG1PPS,4)
// CWG1PPS<CWG1PPS5>
extern volatile __bit                   CWG1PPS5            __at(0xF1CD);	// @ (0x1E39 * 8 + 5)
#define                                 CWG1PPS5_bit        _BIT_ACCESS(CWG1PPS,5)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x30A0);	// @ (0x614 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x30A1);	// @ (0x614 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x30A2);	// @ (0x614 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x30A3);	// @ (0x614 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CLCnSEL0<D1S0>
extern volatile __bit                   D1S0                __at(0x3470);	// @ (0x68E * 8 + 0)
#define                                 D1S0_bit            _BIT_ACCESS(CLCnSEL0,0)
// CLCnSEL0<D1S1>
extern volatile __bit                   D1S1                __at(0x3471);	// @ (0x68E * 8 + 1)
#define                                 D1S1_bit            _BIT_ACCESS(CLCnSEL0,1)
// CLCnSEL0<D1S2>
extern volatile __bit                   D1S2                __at(0x3472);	// @ (0x68E * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0x3473);	// @ (0x68E * 8 + 3)
#define                                 D1S3_bit            _BIT_ACCESS(CLCnSEL0,3)
// CLCnSEL0<D1S4>
extern volatile __bit                   D1S4                __at(0x3474);	// @ (0x68E * 8 + 4)
#define                                 D1S4_bit            _BIT_ACCESS(CLCnSEL0,4)
// CLCnSEL0<D1S5>
extern volatile __bit                   D1S5                __at(0x3475);	// @ (0x68E * 8 + 5)
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL0<D1S6>
extern volatile __bit                   D1S6                __at(0x3476);	// @ (0x68E * 8 + 6)
#define                                 D1S6_bit            _BIT_ACCESS(CLCnSEL0,6)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0x3478);	// @ (0x68F * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0x3479);	// @ (0x68F * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0x347B);	// @ (0x68F * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0x347C);	// @ (0x68F * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL1<D2S6>
extern volatile __bit                   D2S6                __at(0x347E);	// @ (0x68F * 8 + 6)
#define                                 D2S6_bit            _BIT_ACCESS(CLCnSEL1,6)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0x3480);	// @ (0x690 * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0x3481);	// @ (0x690 * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0x3482);	// @ (0x690 * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0x3483);	// @ (0x690 * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0x3484);	// @ (0x690 * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0x3485);	// @ (0x690 * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL2<D3S6>
extern volatile __bit                   D3S6                __at(0x3486);	// @ (0x690 * 8 + 6)
#define                                 D3S6_bit            _BIT_ACCESS(CLCnSEL2,6)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
extern volatile __bit                   D4S4                __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 D4S4_bit            _BIT_ACCESS(CLCnSEL3,4)
// CLCnSEL3<D4S5>
extern volatile __bit                   D4S5                __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 D4S5_bit            _BIT_ACCESS(CLCnSEL3,5)
// CLCnSEL3<D4S6>
extern volatile __bit                   D4S6                __at(0x348E);	// @ (0x691 * 8 + 6)
